# Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов.
# 
# Формат ввода
# 
# Вводится строка.
# 
# Формат вывода
# 
# Выведите ответ на задачу.
# 
# Примеры
# 
# Тест 1
# Входные данные:
# Hello world
# 
# Вывод программы:
# 2
# 
# 
# 
# Тест 2
# Входные данные:
# Hello
# 
# Вывод программы:
# 1
# 
# 
# 
# Тест 3
# Входные данные:
# q w e
# 
# Вывод программы:
# 3
s = str(input())
x = s.count(' ')
if x == 0:
    print(1)
else:
    print(x+1)