# Дана строка. Получите новую строку, вставив между каждыми двумя символами исходной строки символ *. 
# Выведите полученную строку.
# 
# Формат ввода
# 
# Вводится строка.
# 
# Формат вывода
# 
# Выведите ответ на задачу.
# 
# Примеры
# 
# Тест 1
# Входные данные:
# Python
# 
# Вывод программы:
# P*y*t*h*o*n
# 
# 
# 
# Тест 2
# Входные данные:
# Hello
# 
# Вывод программы:
# H*e*l*l*o
# 
# 
# 
# Тест 3
# Входные данные:
# A
# 
# Вывод программы:
# A
s = str(input())
x = len(s)
while x >= 2:
    s = s[:x-1] + '*' + s[x-1:]
    x = x-1
print(s)