# Цена товара обозначена в рублях с точностью до копеек, то есть действительным числом с двумя цифрами после 
# десятичной точки. Запишите в две целочисленные переменные стоимость товара в виде целого числа рублей и целого
# числа копеек и выведите их на экран. При решении этой задачи нельзя пользоваться условными инструкциями и циклами.
# 
# Формат ввода
# 
# Вводится неотрицательное действительное число.
# 
# Формат вывода
# 
# Выведите ответ на задачу.
# 
# Примеры
# 
# Тест 1
# Входные данные:
# 10.35
# 
# Вывод программы:
# 10 35
# 
# 
# 
# Тест 2
# Входные данные:
# 1.99
# 
# Вывод программы:
# 1 99
# 
# 
# 
# Тест 3
# Входные данные:
# 3.50
# 
# Вывод программы:
# 3 50
n = float(input())
rub = int(n)
kop = n*100 - rub*100
print(rub, int(kop))